// Функція для виконання XOR-операції між двома шістнадцятковими рядками
const xor = (a, b) => {
    // Ініціалізуємо результат як порожній рядок
    let res = '';
    
    // Проходимо по кожному символу у рядку a
    for (let i = 0; i < a.length; i++) {
        // Виконуємо XOR для кожного символу a та b, конвертуючи з шістнадцяткового в десятковий
        // Додаємо результат в шістнадцятковому форматі до рядка результату
        res += (parseInt(a[i], 16) ^ parseInt(b[i], 16)).toString(16);
    }
    
    // Повертаємо шістнадцятковий рядок результату
    return res;
}

// Зчитуємо три рядки вхідних даних і виконуємо XOR-операції
// Використовуємо два виклику функції xor для отримання остаточного результату
// Декодуємо результат з шістнадцяткового формату в текстовий формат
console.log(
    xor(xor(readline(), readline()), readline())
        // Замінюємо кожні два символи (байт) на відповідний символ ASCII
        .replace(/../g, x => String.fromCharCode(parseInt(x, 16)))
);
